In [1]:
import pandas as pd

In [2]:
superficie = pd.read_csv('../data/houseMarket/superficie.csv',  names=["superficie"], header=None)
print("ok")

ok

In [3]:
sbd = pd.read_csv('../data/houseMarket/nombre_de_sdb.csv',  names=["sbd"], header=None)
print("ok")

ok

In [4]:
nbchambre = pd.read_csv('../data/houseMarket/nombre_de_chambres.csv',  names=["nbchambre"], header=None)
print("ok")

ok

In [5]:
superficie[0:5]

   superficie
0       28844
1       27667
2       14742
3       28089
4       11713

In [6]:
dataset = pd.concat([superficie, sbd, nbchambre],axis=1)

In [7]:
dataset.head()

   superficie  sbd  nbchambre
0       28844    2          1
1       27667    1          4
2       14742    1          1
3       28089    3          4
4       11713    1          2

In [8]:
dataset["superficie"].mean()

20439.77

In [9]:
house_price = pd.read_csv('../data/houseMarket/house_price.csv')
print("ok")

ok

In [10]:
dataset['id'] = dataset.index

In [11]:
dataset.head()

   superficie  sbd  nbchambre  id
0       28844    2          1   0
1       27667    1          4   1
2       14742    1          1   2
3       28089    3          4   3
4       11713    1          2   4

In [12]:
house_price[0:5]

   Unnamed: 0  id  house_price
0           0  14    1918154.0
1           1  30     739142.0
2           2  70    1621938.0
3           3  77    1319862.0
4           4  50     146250.0

In [13]:
dataset = pd.merge(dataset, house_price, left_on = "id", right_on = "id", how="inner")

In [14]:
dataset[0:5]

   superficie  sbd  nbchambre  id  Unnamed: 0  house_price
0       28844    2          1   0          32    1421908.0
1       27667    1          4   1          71    1305091.0
2       14742    1          1   2          65     164373.0
3       28089    3          4   3          88    1441714.0
4       11713    1          2   4          49     108290.0

In [17]:
dataset["price_per_room"]=dataset.house_price/dataset.nbchambre

In [18]:
dataset[0:5]

   superficie  sbd  nbchambre  id  Unnamed: 0  house_price  price_per_room
0       28844    2          1   0          32    1421908.0      1421908.00
1       27667    1          4   1          71    1305091.0       326272.75
2       14742    1          1   2          65     164373.0       164373.00
3       28089    3          4   3          88    1441714.0       360428.50
4       11713    1          2   4          49     108290.0        54145.00

In [19]:
dataset["price_per_room"].mean()

425415.17083333334

In [22]:
dataset["taille_maison"]=0

In [37]:
def setHouseSize (data):
    if data["superficie"]>25000 : 
        return "très grande"
    if data["superficie"]<=25000 and data["superficie"]>20000 : 
        return "grande"
    if data["superficie"]<=20000 and data["superficie"]>15000 : 
        return "moyenne"
    if data["superficie"]<=15000 and data["superficie"]>10000 : 
        return "petite"
    else : 
        return "très petite"

In [38]:
dataset["taille_maison"]= dataset.apply (lambda dataset: setHouseSize(dataset), axis=1)

In [39]:
dataset[0:5]

,superficie,sbd,nbchambre,id,Unnamed: 0,house_price,price_per_room,taille_maison
0,28844,2,1,0,32,1421908.0,1421908.00,très grande
1,27667,1,4,1,71,1305091.0,326272.75,très grande
2,14742,1,1,2,65,164373.0,164373.00,petite
3,28089,3,4,3,88,1441714.0,360428.50,très grande
4,11713,1,2,4,49,108290.0,54145.00,petite